##### Zadanie 5- Domowe

Poniżej podany jest zestaw danych. Zawiera on brakujące wartości. Twoim zadaniem jest przygotować ten zestaw danych do obróbki a następnie wytrenować klasyfikator przewidujący choroby serca dobierając ilość kroków oraz learning rate.

Wartością docelową jest `num`

Twoim celem jest odrzucenie zmiennych charakteryzujących się dużą ilością wartości brakujących oraz uzupełnienie pozostałych kolumn. Użyj do tego na przykład funkcji `pd.DataFrame.isna`, `pd.DataFrame.sum` oraz metody `pd.Series.fillna`.

Użyj metody `xgb.cv` do ustalenia przebiegu treningu. Postaraj się dobrać takie wartości ilości kroków oraz learning rate aby przeuczyć (overfit) klasyfikator. Zacznij od learning rate `0.01`. Kiedy klasyfikator zostanie przetrenowany, użyj wykresu błędu w zależności od ilości kroków aby wyznaczyć przybliżoną optymalną ilość drzew dla danego modelu i wytrenuj ostateczny model.

Dodatkowe info: `xgb` obsługuje brakujące wartości przez parametr `missing`. Możesz (nie musisz) użyć tego zamiast interpolacji brakujących wartości.

In [19]:
import pandas as pd
import numpy as np

data = pd.read_csv("./data/heart.csv")
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 294 entries, 0 to 293
Data columns (total 14 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   age         294 non-null    int64
 1   sex         294 non-null    int64
 2   cp          294 non-null    int64
 3   trestbps    294 non-null    object
 4   chol        294 non-null    object
 5   fbs         294 non-null    object
 6   restecg     294 non-null    object
 7   thalach     294 non-null    object
 8   exang       294 non-null    object
 9   oldpeak     294 non-null    float64
 10  slope       294 non-null    object
 11  ca          294 non-null    object
 12  thal        294 non-null    object
 13  num         294 non-null    int64
dtypes: float64(1), int64(4), object(9)
memory usage: 32.3+ KB

In [3]:
data.head()

,age,sex,cp,trestbps,chol,fbs,restecg,thalach,exang,oldpeak,slope,ca,thal,num
0,28,1,2,130,132,0,2,185,0,0.0,?,?,?,0
1,29,1,2,120,243,0,0,160,0,0.0,?,?,?,0
2,29,1,2,140,?,0,0,170,0,0.0,?,?,?,0
3,30,0,1,170,237,0,1,170,0,0.0,?,?,6,0
4,31,0,2,100,219,0,1,150,0,0.0,?,?,?,0

In [8]:
data.isin(["?"]).sum()

age             0
sex             0
cp              0
trestbps        1
chol           23
fbs             8
restecg         1
thalach         1
exang           1
oldpeak         0
slope         190
ca            291
thal          266
num             0
dtype: int64

In [35]:
df = data.drop(["slope","ca","thal"], axis=1)
df

     age  sex  cp trestbps chol fbs restecg thalach exang  oldpeak  num
0     28    1   2      130  132   0       2     185     0      0.0           0
1     29    1   2      120  243   0       0     160     0      0.0           0
2     29    1   2      140    ?   0       0     170     0      0.0           0
3     30    0   1      170  237   0       1     170     0      0.0           0
4     31    0   2      100  219   0       1     150     0      0.0           0
..   ...  ...  ..      ...  ...  ..     ...     ...   ...      ...         ...
289   52    1   4      160  331   0       0      94     1      2.5           1
290   54    0   3      130  294   0       1     100     1      0.0           1
291   56    1   4      155  342   1       0     150     1      3.0           1
292   58    0   2      180  393   0       0     110     1      1.0           1
293   65    1   4      130  275   0       1     115     1      1.0           1

[294 rows x 11 columns]

In [29]:
df["fbs"].unique()

array(['0', '?', '1'], dtype=object)

In [30]:
df["restecg"].unique()

array(['2', '0', '1', '?'], dtype=object)

In [31]:
df["exang"].unique()

array(['0', '1', '?'], dtype=object)

In [40]:
df = df.replace("?",np.nan)
df

     age  sex  cp trestbps chol fbs restecg thalach exang  oldpeak  num
0     28    1   2      130  132   0       2     185     0      0.0           0
1     29    1   2      120  243   0       0     160     0      0.0           0
2     29    1   2      140  NaN   0       0     170     0      0.0           0
3     30    0   1      170  237   0       1     170     0      0.0           0
4     31    0   2      100  219   0       1     150     0      0.0           0
..   ...  ...  ..      ...  ...  ..     ...     ...   ...      ...         ...
289   52    1   4      160  331   0       0      94     1      2.5           1
290   54    0   3      130  294   0       1     100     1      0.0           1
291   56    1   4      155  342   1       0     150     1      3.0           1
292   58    0   2      180  393   0       0     110     1      1.0           1
293   65    1   4      130  275   0       1     115     1      1.0           1

[294 rows x 11 columns]

In [44]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 294 entries, 0 to 293
Data columns (total 11 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   age         294 non-null    int64
 1   sex         294 non-null    int64
 2   cp          294 non-null    int64
 3   trestbps    293 non-null    object
 4   chol        271 non-null    object
 5   fbs         286 non-null    object
 6   restecg     293 non-null    object
 7   thalach     293 non-null    object
 8   exang       293 non-null    object
 9   oldpeak     294 non-null    float64
 10  num         294 non-null    int64
dtypes: float64(1), int64(4), object(6)
memory usage: 25.4+ KB

In [45]:
df.columns

Index(['age', 'sex', 'cp', 'trestbps', 'chol', 'fbs', 'restecg', 'thalach',
       'exang', 'oldpeak', 'num       '],
      dtype='object')

In [49]:
y = df.num
x = df.drop(['num       '], axis=1)

AttributeError: 'DataFrame' object has no attribute 'num'